ez-xu/HC32F4A0_Lwip_Shared/Project/FreeRTOS/Source/include/FreeRTOSConfig.h
/*
 * FreeRTOS V202107.00
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://www.FreeRTOS.org
 * http://aws.amazon.com/freertos
 *
 * 1 tab == 4 spaces!
 */


#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

/*-----------------------------------------------------------
 * Application specific definitions.
 *
 * These definitions should be adjusted for your particular hardware and
 * application requirements.
 *
 * THESE PARAMETERS ARE DESCRIBED WITHIN THE 'CONFIGURATION' SECTION OF THE
 * FreeRTOS API DOCUMENTATION AVAILABLE ON THE FreeRTOS.org WEB SITE.
 *
 * See http://www.freertos.org/a00110.html
 *----------------------------------------------------------*/

/* Ensure stdint is only used by the compiler, and not the assembler. */
#if defined(__ICCARM__) || defined(__CC_ARM) || defined(__GNUC__)
#include <stdint.h>
extern uint32_t SystemCoreClock;
#endif
#include "hc32f4a0.h"

#define configUSE_PREEMPTION            1 //抢占式调度器开关
#define configUSE_IDLE_HOOK             0 //空闲任务钩子函数
#define configUSE_TICK_HOOK             0 //时间片钩子函数
#define configCPU_CLOCK_HZ              ( SystemCoreClock ) //CPU主频
#define configTICK_RATE_HZ              ( ( TickType_t ) 1000 ) //RTOS节拍频率 即1秒的中断次数
#define configMAX_PRIORITIES            ( 15 )//( 8 ) //可使用的最大优先级
#define configMINIMAL_STACK_SIZE        ( ( unsigned short ) 128 ) //定义空闲任务使用的堆栈大小
#define configTOTAL_HEAP_SIZE           ( ( size_t ) ( 64 * 1024 ) ) //RTOS内核总计可用的有效RAM大小
#define configMAX_TASK_NAME_LEN         ( 16 ) //任务名最大长度
#define configUSE_TRACE_FACILITY        1 //是否启动可视化跟踪调试
#define configUSE_16_BIT_TICKS          0 //系统节拍计数器的变量类型 0为32位 1为16位
#define configIDLE_SHOULD_YIELD         1 //空闲任务放弃CPU使用权给其他同优先级的用户任务
#define configUSE_MUTEXES               1 //是否使用互斥信号量
#define configQUEUE_REGISTRY_SIZE       8 //设置可以注册的信号量和消息队列个数
#define configCHECK_FOR_STACK_OVERFLOW  2 //堆栈溢出检查 大于0有效
#define configUSE_RECURSIVE_MUTEXES     1 //是否使用递归信号量
#define configUSE_MALLOC_FAILED_HOOK    0 //内存申请失败钩子函数
#define configUSE_APPLICATION_TASK_TAG  0 //为任务分配标签
#define configUSE_COUNTING_SEMAPHORES   1 //是否使用计数信号量
#define configGENERATE_RUN_TIME_STATS   0 //是否启用运行时间统计功能
#define configSUPPORT_STATIC_ALLOCATION 1
#define configSUPPORT_DYNAMIC_ALLOCATION 1

/* Co-routine definitions. */
#define configUSE_CO_ROUTINES       0 //启用协程 启用协程后必须添加文件croutine.c
#define configMAX_CO_ROUTINE_PRIORITIES ( 2 ) //协程的有效优先级数目

/* Software timer definitions. */
#define configUSE_TIMERS                1 //是否启用软件定时器
#define configTIMER_TASK_PRIORITY       ( 2 ) //软件定时器优先级
#define configTIMER_QUEUE_LENGTH        10 //软件定时器队列长度
#define configTIMER_TASK_STACK_DEPTH    ( configMINIMAL_STACK_SIZE * 2 ) //软件定时器任务堆栈大小

/* Set the following definitions to 1 to include the API function, or zero
to exclude the API function. */ //是否启用TROS API函数
#define INCLUDE_vTaskPrioritySet        1
#define INCLUDE_uxTaskPriorityGet       1
#define INCLUDE_vTaskDelete             1
#define INCLUDE_vTaskCleanUpResources   0
#define INCLUDE_vTaskSuspend            1
#define INCLUDE_vTaskDelayUntil         1
#define INCLUDE_vTaskDelay              1
#define INCLUDE_xTaskGetSchedulerState  1

/* Cortex-M specific definitions. */
#ifdef __NVIC_PRIO_BITS
/* __BVIC_PRIO_BITS will be specified when CMSIS is being used. */
#define configPRIO_BITS                 __NVIC_PRIO_BITS
#else
#define configPRIO_BITS                 4        /* 15 priority levels */
#endif

/* The lowest interrupt priority that can be used in a call to a "set priority"
function. */
#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY         0xf

/* The highest interrupt priority that can be used by any interrupt service
routine that makes calls to interrupt safe FreeRTOS API functions.  DO NOT CALL
INTERRUPT SAFE FREERTOS API FUNCTIONS FROM ANY INTERRUPT THAT HAS A HIGHER
PRIORITY THAN THIS! (higher priorities are lower numeric values. */
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY    5

/* Interrupt priorities used by the kernel port layer itself.  These are generic
to all Cortex-M ports, and do not rely on any particular library functions. */
#define configKERNEL_INTERRUPT_PRIORITY         ( configLIBRARY_LOWEST_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )
/* !!!! configMAX_SYSCALL_INTERRUPT_PRIORITY must not be set to zero !!!!
See http://www.FreeRTOS.org/RTOS-Cortex-M3-M4.html. */
#define configMAX_SYSCALL_INTERRUPT_PRIORITY    ( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )

/* Normal assert() semantics without relying on the provision of an assert.h
header file. */
#define configASSERT( x ) if( ( x ) == 0 ) { taskDISABLE_INTERRUPTS(); for( ;; ); }

/* Definitions that map the FreeRTOS port interrupt handlers to their CMSIS
standard names. */
#define vPortSVCHandler SVC_Handler
#define xPortPendSVHandler PendSV_Handler
#define xPortSysTickHandler SysTick_Handler 

#endif /* FREERTOS_CONFIG_H */

